app/controllers/hub_controller.rb

  def hubhome
    @title = "Hub"
    @announcements = Announcement.find_most_recent
---
SELECT * FROM `announcements` ORDER BY created_at DESC