app/controllers/profile_controller.rb

def myaccount
     @profile = Profile.find(:first, :conditions => [ "user_id='"+UserSession.find.user.id.to_s+"'"], :limit => 1)
---
SELECT * FROM `profiles` WHERE (user_id='1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1